<template>
  <v-container>
    <PageHeader text="سياسة الخصوصية" icon="assignment">
    </PageHeader>
    <v-card flat class="small-round-corners light-box-shadow">
      <v-container>
        <section>
          <p class="subheading">
            تطلعك هذه الصفحة على سياسة isharah.com ("الموقع"، "الخدمة") المتعلقة بجمع البيانات الشخصية واستخدامها والكشف عنها عند استخدامك للخدمة والخيارات المرتبطة بهذه البيانات.
            <br />
            ونحن نستخدم بياناتك لتوفير الخدمة وتحسينها. ومن خلال استخدام هذه الخدمة، فإنك توافق على جمع واستخدام المعلومات وفقًا لهذه السياسة. وما لم يُذكر خلاف ذلك في سياسة الخصوصية هذه، فإن المصطلحات المستخدمة في سياسة الخصوصية هذه تحمل نفس المعاني المقترنة بها كما في الأحكام والشروط.
          </p>
        </section>
        <br />
        <section>
          <h1>
            خصوصية الأطفال
          </h1>
          <p class="subheading">
            لا تتعامل خدمتنا مع أي شخص دون سن 18 عامًا ("الأطفال").
            <br />
            نحن لا نجمع علما معلومات التعريف الشخصية من أي شخص دون سن 18 عامًا. إذا كنت أحد الوالدين أو وليّ أمر وكنت على علم بأن طفلك قد زودنا بالبيانات الشخصية، يرجى الاتصال بنا. إذا أصبحنا على علم بأننا جمعنا بيانات شخصية من الأطفال دون التحقق من موافقة الوالدين، فإننا سوف نتخذ خطوات لإزالة تلك المعلومات من خوادمنا.
          </p>
        </section>
        <br />
        <section>
          <h1>
            أنواع البيانات المجمعة
          </h1>
          <h3>
            البيانات الشخصية
          </h3>
          <p class="subheading">
            قد نطلب منك أثناء استخدامك لخدماتنا تزويدنا بمعلومات تعريف شخصية معينة يمكن استخدامها للاتصال أو التعرف عليك ("البيانات الشخصية"). تشمل معلومات التعريف الشخصية، ولا تقتصر على:
          </p>
          <v-container class="subheading" py-0>
            <ul>
              <li>عنوان البريد الإلكتروني</li>
              <li>الاسم الأول واسم العائلة</li>
              <li>المدينة والبلد</li>
              <li>ملفات تعريف الارتباط (الكوكيز) وبيانات الاستخدام</li>
            </ul>
          </v-container>
          <br />
          <h3>
            المحتوى
          </h3>
          <p class="subheading">
            يمكن للمستخدم إنشاء حساب شخصي ورفع محتوى يتكون من فيديوهات. هذا المحتوى يمكن رؤيته من قبل بعض المستخدمين. كذلك يمكن لبعض الأشخاص المرخص لهم معالجة واستخدام المحتوى بغرض البحث العلمي.
          </p>
          <br />
          <h3>
            بيانات الاستخدام
          </h3>
          <p class="subheading">
            قد نجمع أيضًا المعلومات التي يرسلها متصفحك عندما تزور خدمتنا أو عندما تصل إلى الخدمة عن طريق أو من خلال جهاز محمول ("بيانات الاستخدام").
            <br />
            وقد تتضمن بيانات الاستخدام هذه ولا تقتصر على معلومات مثل عنوان بروتوكول الإنترنت الخاص بجهاز الكمبيوتر أو المحمول (مثل عنوان IP)، ونوع المتصفح، ورقم إصدار المتصفح، وصفحات الخدمة التي تزورها، ووقت وتاريخ زيارتك، والوقت الذي تقضيه في تلك الصفحات، ومعرفات الجهاز، وغيرها من البيانات التشخيصية.
          </p>
          <br />
          <h3>
            بيانات التتبع وملفات تعريف الارتباط (الكوكيز)
          </h3>
          <p class="subheading">
            نحن نستخدم ملفات تعريف الارتباط وتقنيات التتبع المماثلة لتتبع النشاط على خدمتنا التي نقدمها مع الاحتفاظ بمعلومات معينة.
            <br />
            ملفات تعريف الارتباط (الكوكيز) هي عبارة عن قدر قليل من البيانات التي قد تتضمن معرف خاص مجهول الهوية. تُرسل ملفات تعريف الارتباط (الكوكيز) إلى متصفحك من موقع إلكتروني وتُخزَّن على جهازك. وتقنيات التتبع المستخدمة هي منارات وعلامات ونصوص لجمع المعلومات وتتبعها ولتحسين خدمتنا وتحليلها.
            <br />
            يمكنك أن تضبط المتصفح الخاص بك لرفض جميع ملفات تعريف الارتباط (الكوكيز)، أو يمكنك أن تحدد متى ينبغي إرسال ملف تعريف الارتباط. ومع ذلك، إذا لم تقبل ملفات تعريف الارتباط (الكوكيز)، فلن تتمكن على الأغلب من استخدام بعض الميزات في خدمتنا.
            <br />
            أمثلة على ملفات تعريف الارتباط (الكوكيز) التي نستخدمها:
          </p>
          <v-container class="subheading" py-0>
            <ul>
              <li>ملفات تعريف الارتباط للجلسة. نستخدم ملفات تعريف الارتباط الخاصة بجلسة لتشغيل خدمتنا.</li>
              <li>ملفات تعريف الارتباط للأفضليات. نستخدم ملفات تعريف الارتباط الخاصة لأفضلياتك وإعداداتك.</li>
              <li>ملفات تعريف الارتباط للأمان. نستخدم ملفات تعريف الارتباط للأمان لأغراض تتعلق بالأمان.</li>
            </ul>
          </v-container>
        </section>
        <br />
        <section>
          <h1>
            استخدام البيانات
          </h1>
          <p class="subheading">
            تستخدم isharah.com البيانات المجمعة للأغراض التالية:
          </p>
          <v-container class="subheading" py-0>
            <ul>
              <li>تقديم خدمتنا وصيانتها.</li>
              <li>إرسال تنبيهات حول التغييرات التي تطرأ على الخدمة.</li>
              <li>السماح لك بالمشاركة في ميزات الخدمة التفاعلية عندما تختار ذلك.</li>
              <li>تقديم الدعم للمشتركين.</li>
              <li>جميع التحليلات أو المعلومات ذات الأهمية التي يمكن من خلالها تحسين خدمتنا.</li>
              <li>مراقبة استخدام خدمتنا.</li>
              <li>الكشف عن مسائل فنية ومنعها ومعالجتها.</li>
            </ul>
          </v-container>
          <br />
          <h1>
            استخدام محتوى الفيديو
          </h1>
          <h3>
            مجموعة البيانات
          </h3>
          <p class="subheading">
            أحد أهداف isharah.com هو تزويد مجتمع البحث العلمي بمجموعة بيانات ("dataset") لاستخدامها في البحث والتطوير في مجال التعرف على الإشارات باستخدام الذكاء الصناعي. باستخدامك موقع isharah.com، تعطينا حق إضافة أي فيديو تقوم برفعه إلى مجموعة البيانات، المتاحة للأشخاص المرخصين عبر رابط "للمطورين" على موقعنا.
          </p>
          <br />
          <h3>
            القاموس
          </h3>
          <p class="subheading">
            بالإضافة إلى مجموعة البيانات، يمكن أن يتم إضافة الفيديو إلى القاموس الإلكتروني على الموقع، حيث يمكن لجميع زوار الموقع رؤيته. في حالة إضافة الفيديو إلى القاموس، سيتم إخطار المستخدم صاحب الفيديو عبر البريد الإلكتروني.
          </p>
        </section>
        <br />
        <section>
          <h1>
            الاحتفاظ بالبيانات
          </h1>
          <p class="subheading">
            سوف نحتفظ ببياناتك الشخصية كلما لزم الأمر للأغراض المنصوص عليها في سياسة الخصوصية. وسوف نحتفظ ببياناتك الشخصية ونستخدمها بالقدر اللازم للتقيد بالتزاماتنا القانونية (على سبيل المثال، إذا طُلب منا الاحتفاظ ببياناتك للتقيد بالقوانين المعمول بها)، وحل النزاعات، ووضع اتفاقياتنا وسياساتنا القانونية موضع التنفيذ.
            <br />
            وسوف نحتفظ ببيانات الاستخدام أيضًا لاعتبارات تتعلق بالتحليل الداخلي. ويتم الاحتفاظ ببيانات الاستخدام بصفة عامة لفترة زمنية قصيرة، باستثناء ما إذا تم استخدام هذه البيانات لتعزيز الأمن أو لتحسين وظائف خدمتنا، أو إذا تطلب منا القانون الاحتفاظ بهذه البيانات لفترات زمنية أطول.
          </p>
        </section>
        <br />
        <section>
          <h1>
            نقل البيانات
          </h1>
          <p class="subheading">
            قد يتم نقل معلوماتك - بما في ذلك البيانات الشخصية - إلى أجهزة الكمبيوتر الموجودة خارج الولاية أو المقاطعة أو الدولة أو الولاية الحكومية الأخرى التي قد تختلف فيها قوانين حماية البيانات عن تلك الخاصة بمنطقة الاختصاص القضائي في منطقتك.
            <br />
            وإن موافقتك على سياسة الخصوصية هذه وما يتبعها من تقديم لهذه المعلومات التي تخصك يعني أنك موافق على هذا النقل.
            <br />
            سوف نتخذ جميع الخطوات اللازمة بشكل معقول لضمان التعامل مع بياناتك بأمان ووفقًا لسياسة الخصوصية هذه، ولن يتم نقل بياناتك الشخصية إلى منظمة أو دولة أخرى ما لم تكن هناك ضوابط كافية مطبقة، بما في ذلك الأمان، على البيانات الخاصة بك وغيرها من المعلومات الشخصية.
          </p>
        </section>
        <br />
        <section>
          <h1>
            الكشف عن البيانات
          </h1>
          <p class="subheading">
            يجوز لisharah.com الكشف عن بياناتك الشخصية إذا اعتقدت بنية حسنة أن ذلك ضروريًا لـ:
          </p>
          <v-container class="subheading" py-0>
            <ul>
              <li>التقيد بالالتزامات القانونية.</li>
              <li>حماية حقوق أو ممتلكات الموقع والدفاع عنها.</li>
              <li>منع أي مخالفات محتملة تتعلق بالخدمة أو إجراء تحقيقات بشأنها.</li>
              <li>الحفاظ على السلامة الشخصية لمستخدمي الخدمة أو عامة الناس.</li>
              <li>الحماية من المسؤولية القانونية.</li>
            </ul>
          </v-container>
        </section>
        <br />
        <section>
          <h1>
            أمن البيانات
          </h1>
          <p class="subheading">
            أمن بياناتك يهمنا، ولكن تذكر أنه لا توجد طريقة مضمونة وآمنة 100% للإرسال عبر الإنترنت أو للتخزين الإلكتروني. وبينما نبذل قصارى جهدنا لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك الشخصية، لا يمكننا ضمان أمانها بشكل مطلق.
          </p>
        </section>
        <br />
        <section>
          <h1>
            تغيير سياسة الخصوصية
          </h1>
          <p class="subheading">
            يجوز لنا تحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. وسوف نطلعك على أي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.
            <br />
            وسوف نخبرك عبر البريد الإلكتروني و / أو بإشعار بارز في خدمتنا  قبل أن يصبح التغيير ساريًا وتحديث "تاريخ النفاذ" في أعلى سياسة الخصوصية هذه.
            <br />
            ننصحك بمراجعة سياسة الخصوصية هذه بشكل دوري لأية تغييرات. تسري التغييرات التي تطرأ على سياسة الخصوصية هذه عند نشرها على هذه الصفحة.
          </p>
        </section>
      </v-container>
    </v-card>
  </v-container>
</template>
<script>
import PageHeader from '~/components/generic/PageHeader'

export default {
  components: { PageHeader }
}
</script>

<style>
section > h1 {
  font-size: 2em;
  line-height: 2em;
}
section > p {
  margin-bottom: 0;
}
</style>
