<template>
  <v-container>
    <PageHeader text="الشروط واﻷحكام" icon="assignment">
    </PageHeader>
    <v-card flat class="small-round-corners light-box-shadow">
      <v-container>
        <section>
          <p class="subheading">
            نرجو الاطلاع على هذه الشروط والأحكام قبل استخدام isharah.com ("الموقع"، "الخدمة").
            <br />
            إن استخدامك للخدمة مشروط على موافقتك والتزامك بهذه الشروط. هذه الشروط تطبق على جميع زوار ومستخدمي الخدمة. باستخدام الموقع، أنت توافق على الالتزام بهذه الشروط. إذا اعترضت على أي جزء من هذه الشروط، يجب عليك عدم استخدام الموقع.
            <br />
            في حالة عدم الإلتزام بأي مما ورد في هذه الاتفاقية فإن لإدارة الموقع الحق في إيقاف أو إلغاء حسابك وحجبك عن الموقع.
          </p>
        </section>
        <br />
        <section>
          <h1>
            الحسابات
          </h1>
          <p class="subheading">
            فور تقديم طلب التسجيل للحصول على عضوية في الموقع تكون مطالباً بالإفصاح عن معلومات محددة. وعند قبول طلب التسجيل ستعتبر عضوا بالموقع وبذلك تكون ، تكون قد وافقت على:
          </p>
          <v-container class="subheading" py-0>
            <ol>
              <li>تمنح عضوية الموقع فقط لمن تجاوزت أعمارهم ١٨ عام . ولموقع  isharah.com الحق بإلغاء حساب أي عضو لم يبلغ الـ ١٨ عام.</li>
              <li>لا يحق لأي شخص ألغيت عضويته استخدام خصائص الموقع التي تتطلب التسجيل في الموقع.</li>
              <li>أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك وكلمة المرور السرية، وعن أية أنشطة أو أفعال تمت باستخدام حسابك وكلمة مرورك، سواءا كانت كلمة المرور تخص خدمتنا، أو طرفا ثالثا (تسجيل الدخول عن طريق مزود). ويجب عليك إعلامنا فورا بأي اختراق لمعلوماتك السرية أو أي استخدام غير مفوض به لحسابك.</li>
              <li>لن يكون موقع isharah.com بأي حال من الأحوال مسؤولاً عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنويا أو ماديا نتيجة كشف معلومات الحساب أو كلمة المرور.</li>
              <li>الإفصاح بمعلومات حقيقية وصحيحة و محدثة و كاملة عن نفسك حسبما هو مطلوب في استمارة التسجيل لدى isharah.com.</li>
              <li>أن تمتلك حسابا واحدا فقط على الموقع.</li>
            </ol>
          </v-container>
        </section>
        <br />
        <section>
          <h1>
            مشاركات المستخدم
          </h1>
          <p class="subheading">
            إنّ كلّ مشاركاتك على الموقع و/أو ما تقدمه لنا، بما في ذلك وغير مقتصرا على محتوى الفيديو والتعليقات تصبح ملكنا الوحيد والحصري، ولا تعود بأي حالٍ من الأحوال ملكاً لك.
            <br />
            في حالة مشاركات محتوى الفيديو ("الإشارات"):
          </p>
          <v-container class="subheading" py-0>
            <ul>
              <li>غير مسموح على الإطلاق أن يحتوي الفيديو على أية أشخاص غير صاحب الحساب الذي يقوم بالمشاركة ("أنت").</li>
              <li>غير مسموح سوء الاستخدام وذلك بمشاركة فيديوهات عبثية أو غير لائقة أو فيديوهات لا تحتوي على الإشارة التي يدعي المشارك أنها تحتوي عليها.</li>
            </ul>
          </v-container>
        </section>
        <br />
        <section>
          <h1>
            مجموعة البيانات ("dataset")
          </h1>
          <p class="subheading">
            في حالة طلب مجموعة البيانات (في رابط "للمطورين")، أنت توافق على التالي:
          </p>
          <v-container class="subheading" py-0>
            <ol>
              <li>يحق لإدارة isharah.com رفض الطلب بدون إبداء أي سبب.</li>
              <li>في حالة قبول الطلب، تلتزم باستخدام مجموعة البيانات فقط في أغراض بحثية بحتة.</li>
              <li>عدم توزيع أو نشر أو مشاركة مجموعة البيانات مع أي طرف خارج الجهة أو الفرد صاحب الطلب. فعلى أي جهة أو فرد غير صاحب الطلب أن يقوم بطلب آخر على موقعنا لاستخدام مجموعة البيانات.</li>
              <li>عدم استخدام مجموعة البيانات ﻷغراض تجارية.</li>
              <li>عدم استخدام البيانات بطريقة تسبب الضرر أو الإحراج لأي من أصحابها.</li>
            </ol>
          </v-container>
        </section>
        <br />
        <section>
          <h1>
            تعديلات على الشروط والأحكام
          </h1>
          <br />
          <p class="subheading">
            أنت توافق على أن لisharah.com وبمطلق صلاحيته ودون تحمله المسؤولية القانونية أن يجري تعديلات على هذه الإتفاقية دون أن يتطلب ذلك موافقة إضافية من طرفك، وذلك في أي وقت وبأثر فوري، بواسطة بث إعلان عن التعديل على الموقع.
          </p>
        </section>
      </v-container>
    </v-card>
  </v-container>
</template>
<script>
import PageHeader from '~/components/generic/PageHeader'

export default {
  components: { PageHeader }
}
</script>
<style>
ol {
  list-style: arabic-indic
}
section > h1 {
  font-size: 2em;
  line-height: 2em;
}
section > p {
  margin-bottom: 0;
}
</style>
